# vim: syntax=ruby filetype=ruby

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "autoconf"
brew "openssl@1.1"
brew "readline"
brew "automake"
brew "binutils"
#brew "boost"
brew "ocaml"
brew "camlp4"
brew "cmake"
brew "colordiff"
brew "commitizen"
brew "ctags"
brew "curl"
brew "httpie"
brew "coreutils"
# Auto set environment variables when entering directories
brew "direnv"
brew "emacs"
brew "ffmpeg"
# amazing fuzzy finder
brew "fzf"
brew "gcc"
# Glascow Haskell Compiler - not installed by default as it's rather large
#brew "ghc"
brew "ghostscript"
brew "git"
# OpenGL windowing library
brew "glfw"
brew "libgpg-error"
brew "gnupg"
#brew "gnuplot"
brew "go"
# Used for SASL auth with e.g. Gmail
brew "gsasl"
brew "haskell-stack"
# Github hub
brew "hub"
brew "gh"
brew "imagemagick"
#brew "ivy"
#brew "jbig2dec"
#brew "jbig2enc"
brew "jq"
# JSON incremental digger: https://github.com/simeji/jid
brew "jid"
brew "gron"
brew "kubernetes-cli"
brew "kubeseal"
brew "stern"
brew "fluxctl"
brew "awscli"
brew "aws-cdk"
#brew "leiningen"
# great embedded key value database
brew "leveldb"
brew "libxml2"
brew "llvm"
brew "maven"
#brew "mono"
brew "mosh"
brew "mongosh"
brew "mycli"
brew "mysql"
brew "notmuch"
brew "neomutt"
brew "nginx"
brew "nmap"
brew "nss"
brew "node"
brew "opam"
#brew "pandoc"
brew "pgcli"
# pager for psql / pgcli / mysql / etc
brew "pspg"
# For Rasterizing PDFs?
#brew "poppler"
#brew "postgresql"
# Traces things
#brew "potrace"
brew "python"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "rlwrap"
brew "ruby", link: true
brew "sbt"
brew "scala"
brew "shellcheck"
# A much faster replacement to grep esp for programming projects
brew "the_silver_searcher"
brew "ripgrep"
#brew "thrift"
brew "tmux"
brew "transmission-cli"
brew "unrar"
brew "vim"
brew "neovim"
brew "w3m"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
# very good and fast compression
brew "zstd"

# ==== CASKS ====
cask "basictex"
cask "calibre"
cask "kitty"
cask "xquartz"
cask "google-cloud-sdk"
cask "vlc"

# we should or would also add:
# chrome
# firefox
# dropbox
# google drive
# sequel ace
# Visual Studio Code
# 010 Editor?
# Docker for Mac
# FL Studio
# Gimp?
# Krita?
# Darktable?
# Spotify
# Steam
